from django.db import models


class JobCategory(models.Model):
    image = models.ImageField(blank=True,null=True)
    name = models.CharField(max_length=100)

    
    def __str__(self):
        return self.name

class Ostan(models.Model):
    CHOICES = (
    ('گیلان','گیلان'),('مازندران','مازندران'),('آذربایجان شرقی','آذربایجان شرقی'),('آذربایجان غربی','آذربایجان غربی'),('کرمانشاه','کرمانشاه'),('خوزستان','خوزستان'),('فارس','فارس'),('کرمان','کرمان'),('خراسان','خراسان'),('اصفهان','اصفهان'),('سیستان و بلوچستان','سیستان و بلوچستان'),('کردستان','کردستان'),('همدان','همدان'),('چهارمحال و بختیاری','چهارمحال و بختیاری'),('لرستان','لرستان'),('ایلام','ایلام'),('کهگیلویه و بویراحمد','کهگیلویه و بویراحمد'),('بوشهر','بوشهر'),('زنجان','زنجان'),('سمنان','سمنان'),('یزد','یزد'),('هرمزگان','هرمزگان'),('تهران','تهران'),('اردبیل','اردبیل'),('قم','قم'),('قزوین','قزوین'),('گلستان','گلستان'),('خراسان شمالی','خراسان شمالی'),('خراسان جنوبی','خراسان جنوبی'),('البرز','البرز'),('مرکزی','مرکزی'),
    )
    name = models.CharField(max_length=20,choices=CHOICES)

    def __str__(self):
        return self.name


class Job(models.Model):
    pass